[
  "Can you walk me through exactly what you're working on right now?",
  "Why did you choose to do it that way?",
  "Have you sent that email yet?",
  "Can you CC me on all your communications?",
  "How long will this task take, exactly?",
  "Can you update me every hour on your progress?",
  "Did you start that task I mentioned yesterday?",
  "Who did you talk to about this?",
  "Can you show me the draft before you continue?",
  "Why isn't this done yet?",
  "Can you document everything you're doing in real-time?",
  "Did you log your time for that task?",
  "Have you prioritized this the way I would?",
  "Why didn’t you check with me before making that decision?",
  "Can I see your calendar for today?",
  "Are you available to hop on a quick call right now?",
  "Did you use the exact format I provided?",
  "What’s taking so long with this?",
  "Can you redo it using the method I described?",
  "Have you checked in with everyone involved?",
  "Why haven’t I seen a status update yet?",
  "Can you send me a summary after every meeting you attend?",
  "Did you verify every detail before proceeding?",
  "Can you copy me in every message you send to the team?",
  "Are you sure you’re doing this the right way?",
  "What’s your exact plan for today?",
  "How do you know this solution will work?",
  "Can you explain every step you've taken so far?",
  "Have you double-checked everything yet?",
  "Can you break this task down into smaller steps for me?",
  "Why didn’t you let me know before starting that?",
  "Can we go over your to-do list together?",
  "Can you run all ideas by me first?",
  "Are you working on what I asked you to first?",
  "Have you logged every change you made?",
  "What’s your status on this task now? And now?",
  "Can you tell me exactly when you'll be done?",
  "Can you let me know before you take any break?",
  "Can I shadow your meeting to make sure things go well?",
  "Why didn't you update the spreadsheet yet?",
  "Can you make sure to use the exact color I approved?",
  "Can I see every version of this document?",
  "Can you show me a live preview of your screen?",
  "Why did you switch tools without asking me?",
  "Can you account for how each hour was spent?",
  "Have you written a retrospective yet for today?",
  "Can you triple-check before submitting anything?",
  "Are you following the checklist I gave you precisely?",
  "Can you explain why you did not include me in that call?",
  "Have you re-read the instructions again before starting?"
]